<?php

$config['err_code'] = array(
    -1		=> '系统异常',
    0		=> '请求成功',
    -2      => '操作失败',
    -3      => '有错误但前端不弹框提示',

    // 接口验证，参数验证相关
    400		=> '密钥错误，请求无效',
    401		=> '不存在的版本号',
    402		=> '密钥比对失败',
    403     => '存在异常参数',
    404		=> '接口不存在',
    405		=> '缺少必传参数',
    406		=> '没有权限操作',
	407     => '参数值不在协议范围内',//不是约定好的值
	
    // 帐号相关
    101		=> '账号有误，请核对输入的账号及密码',
    102		=> '验证码错误',
    103		=> '不存在的帐号，请先注册',
    104		=> '密码错误',
    105		=> '设备ID异常，请重新登陆',
    106		=> '由于网络原因，形象照上传失败',
    107		=> '数据新增失败',
    108		=> '数据更新失败',
    109     => '账号为空',
    110     => '账号所属机场三字码为空',
    111     => '账号已失效',
    112     => '账号已关闭',
    113     => '密码至少8位',
    114     => '账号已存在',
    115     => '验证码发送失败',
);